Repository: chmc/listall
Catalog: ListAll/ListAll/Localizable.xcstrings
Source language: en
Languages: fi

# %lld (%lld) items
source: %1$lld (%2$lld) items
fi: %1$lld (%2$lld) tuotetta

source: %lld items
fi: %lld tuotetta

source: %lld items to update
fi: %lld tuotetta päivitettävänä

source: %lld lists to update
fi: %lld listaa päivitettävänä

source: %lld new items
fi: %lld uutta tuotetta

source: %lld new lists
fi: %lld uutta listaa

# %lld of %lld items
source: %1$lld of %2$lld items
fi: %1$lld / %2$lld tuotetta

# %lld of %lld tips viewed
source: %1$lld of %2$lld tips viewed
fi: %1$lld / %2$lld vinkkiä katsottu

source: %lld operations pending
fi: %lld toimintoa odottaa

source: %lld Selected
fi: %lld valittu

source: %lld tips viewed
fi: %lld vinkkiä katsottu

source: %lld total
fi: %lld yhteensä

# %lld/%lld viewed
source: %1$lld/%2$lld viewed
fi: %1$lld/%2$lld katsottu

source: %lld/50,000 characters
fi: %lld/50 000 merkkiä

source: 💡 Quick Tips
fi: 💡 Pikavinkit

source: 💡 Suggestions appear based on your previous items
fi: 💡 Ehdotukset perustuvat aiempiin tuotteisiisi

source: 1 hour
fi: 1 tunti

source: 1 item to update
fi: 1 tuote päivitettävänä

source: 1 list to update
fi: 1 lista päivitettävänä

source: 1 minute
fi: 1 minuutti

source: 1 new item
fi: 1 uusi tuote

source: 1 new list
fi: 1 uusi lista

source: 5 minutes
fi: 5 minuuttia

source: 15 minutes
fi: 15 minuuttia

source: 30 minutes
fi: 30 minuuttia

source: About
fi: Tietoja

source: About Export Options
fi: Tietoja vientiasetuksista

source: Active
fi: Aktiiviset

source: Active Items:
fi: Aktiivisia tuotteita:

source: Active Only
fi: Vain aktiiviset

source: Add
fi: Lisää

source: Add Item
fi: Lisää tuote

source: Add item button position
fi: Lisää kohde -painikkeen sijainti

source: Add items on your iPhone
fi: Lisää tuotteita iPhonellasi

source: Add new item
fi: Lisää uusi tuote

source: Add Photo
fi: Lisää kuva

source: Add Your First Item
fi: Lisää ensimmäinen tuotteesi

source: After 1 hour in background
fi: 1 tunnin kuluttua taustalla

source: After 1 minute in background
fi: 1 minuutin kuluttua taustalla

source: After 5 minutes in background
fi: 5 minuutin kuluttua taustalla

source: After 15 minutes in background
fi: 15 minuutin kuluttua taustalla

source: After 30 minutes in background
fi: 30 minuutin kuluttua taustalla

source: All
fi: Kaikki

source: All Done! 🎉
fi: Kaikki valmista! 🎉

source: All Feature Tips
fi: Kaikki ominaisuusvinkit

source: All Items
fi: Kaikki tuotteet

source: All items are completed
fi: Kaikki tuotteet on suoritettu

source: And %lld more...
fi: Ja %lld lisää...

source: App Language
fi: Sovelluksen kieli

source: Append as New
fi: Lisää uutena

source: Archive
fi: Arkistoi

source: Archive "%@"? You can restore it later from the archived lists.
fi: Arkistoida "%@"? Voit palauttaa sen myöhemmin arkistoiduista listoista.

# Archive %lld %@? You can restore them later from archived lists.
source: Archive %1$lld %2$@? You can restore them later from archived lists.
fi: Arkistoida %lld %@? Voit palauttaa ne myöhemmin arkistoiduista listoista.

source: Archive completed lists to keep your workspace clean
fi: Arkistoi valmiit listat pitääksesi työtilasi siistinä

source: Archive List
fi: Arkistoi lista

source: Archive Lists
fi: Arkistoi listat

source: Archived
fi: Arkistoitu

source: Archived List
fi: Arkistoitu lista

source: Archived Lists
fi: Arkistoidut listat

source: Archived lists will appear here
fi: Arkistoidut listat näkyvät tässä

source: Are you sure you want to delete %lld item(s)? This action cannot be undone.
fi: Haluatko varmasti poistaa %lld tuotetta? Tätä toimintoa ei voi peruuttaa.

source: Are you sure you want to permanently delete "%@"? This action cannot be undone. All items and images in this list will be permanently deleted.
fi: Haluatko varmasti poistaa pysyvästi "%@"? Tätä toimintoa ei voi peruuttaa. Kaikki tuotteet ja kuvat tästä listasta poistetaan pysyvästi.

source: Are you sure you want to permanently delete "%@"? This action cannot be undone. All items and images will be permanently deleted.
fi: Haluatko varmasti poistaa pysyvästi "%@"? Tätä toimintoa ei voi peruuttaa. Kaikki tuotteet ja kuvat poistetaan pysyvästi.

source: Ascending
fi: Nouseva

source: Authenticating...
fi: Todennetaan...

source: Authentication Failed
fi: Todentaminen epäonnistui

source: Authentication will be required %1$@ when returning to the app. You can use %2$@ or your device passcode.
fi: Todentaminen vaaditaan %1$@, kun palaat sovellukseen. Voit käyttää %2$@ tai laitteen PIN-koodia.

source: Biometric authentication is not set up on this device.
fi: Biometrista todentamista ei ole määritetty tässä laitteessa.

source: Biometric authentication not available
fi: Biometrinen todentaminen ei saatavilla

source: Build
fi: Koontiversio

source: Cancel
fi: Peruuta

source: Cancel Export
fi: Peruuta vienti

source: Change the app language. You may need to restart the app for all changes to take effect.
fi: Vaihda sovelluksen kieli. Sovellus on ehkä käynnistettävä uudelleen, jotta kaikki muutokset tulevat voimaan.

source: Checking...
fi: Tarkistetaan...

source: Choose a format to share or backup your data
fi: Valitse muoto tietojen jakamiseen tai varmuuskopiointiin

source: Choose from Library
fi: Valitse kirjastosta

source: Choose which items to display
fi: Valitse mitä tuotteita näytetään

source: Clear
fi: Tyhjennä

source: Complete data with all details
fi: Täydelliset tiedot kaikilla yksityiskohdilla

source: Completed
fi: Suoritettu

source: Completed Items:
fi: Suoritettuja tuotteita:

source: Confirm Import
fi: Vahvista tuonti

source: Conflict Details
fi: Ristiriidan tiedot

source: Conflicts (%lld)
fi: Ristiriidat (%lld)

source: Copy
fi: Kopioi

# Copy %lld item(s) to "%@"? Items will remain in this list.
source: Copy %1$lld item(s) to "%2$@"? Items will remain in this list.
fi: Kopioi %lld tuotetta listaan "%@"? Tuotteet säilyvät tässä listassa.

source: Copy Items
fi: Kopioi tuotteita

source: Copy to Clipboard
fi: Kopioi leikepöydälle

source: Create
fi: Luo

source: Create a new list to %@ items to
fi: Luo uusi lista johon %@ tuotteet

source: Create Custom List
fi: Luo oma lista

source: Create duplicates with new IDs
fi: Luo kaksoiskappaleita uusilla tunnisteilla

source: Create Lists
fi: Luo listoja

source: Create lists on your iPhone to see them here
fi: Luo listoja iPhonellasi nähdäksesi ne täällä

source: Create New List
fi: Luo uusi lista

source: Created Date
fi: Luontipäivä

source: Crossed Out Items
fi: Yliviivatut tuotteet

source: Crossed Out Only
fi: Vain yliviivatut

source: Customize what data to include in your export. Default includes everything, while minimal exports only essential information.
fi: Mukauta vientiin sisällytettävät tiedot. Oletus sisältää kaiken, minimaalinen vie vain olennaiset tiedot.

source: Data
fi: Tiedot

source: Dates
fi: Päivämäärät

source: Default Sort Order
fi: Oletusjärjestys

source: Delete
fi: Poista

source: Delete all data and import fresh
fi: Poista kaikki ja tuo uudelleen

source: Delete Image?
fi: Poista kuva?

source: Delete Items
fi: Poista tuotteita

source: Delete Lists
fi: Poista listat

source: Delete Permanently
fi: Poista pysyvästi

source: Deleted
fi: Poistettu

source: Desc
fi: Kuv

source: Descending
fi: Laskeva

source: Description
fi: Kuvaus

source: Description (Optional)
fi: Kuvaus (valinnainen)

source: Deselect All
fi: Poista kaikki valinnat

source: Direction
fi: Suunta

source: Discard
fi: Hylkää

source: Discard Changes?
fi: Hylätäänkö muutokset?

source: Dismiss
fi: Sulje

source: Dismiss tooltip
fi: Sulje vihje

source: Display
fi: Näyttö

source: Do you want to restore "%@" to your active lists?
fi: Haluatko palauttaa "%@" aktiivisiin listoihisi?

source: Done
fi: Valmis

source: Double tap to edit
fi: Kaksoisnapauta muokataksesi

source: Drag-to-reorder disabled (change to 'Order' to enable)
fi: Vedä järjestääksesi pois käytöstä (vaihda 'Järjestykseen' ottaaksesi käyttöön)

source: Drag-to-reorder enabled
fi: Vedä järjestääksesi käytössä

source: Duplicate
fi: Monista

source: Duplicate List
fi: Monista lista

source: Edit
fi: Muokkaa

source: Edit Item
fi: Muokkaa tuotetta

source: Edit items
fi: Muokkaa tuotteita

source: Edit List
fi: Muokkaa listaa

source: Edit list name: %@
fi: Muokkaa listan nimeä: %@

source: Enable Face ID or Touch ID in Settings
fi: Ota Face ID tai Touch ID käyttöön Asetuksista

source: Enter item name
fi: Syötä tuotteen nimi

source: Enter list name
fi: Syötä listan nimi

source: Entity:
fi: Kohde:

source: Error
fi: Virhe

source: Export Data
fi: Vie tiedot

source: Export Options
fi: Vientivalinnat

source: Export to CSV
fi: Vie CSV-muodossa

source: Export to File
fi: Vie tiedostoon

source: Export to JSON
fi: Vie JSONina

source: Export to Plain Text
fi: Vie pelkkänä tekstinä

source: Export your lists and items
fi: Vie listasi ja tuotteesi

source: Exporting...
fi: Viedään...

source: Feature Tips
fi: Ominaisuusvinkit

source: Feature tips help you discover app functionality. Reset to see all tips again.
fi: Ominaisuusvinkit auttavat löytämään sovelluksen toiminnot. Nollaa nähdäksesi kaikki vinkit uudelleen.

source: Filter
fi: Suodata

source: Filter items
fi: Suodata tuotteita

source: Filtered Items:
fi: Suodatettuja tuotteita:

source: Filtering
fi: Suodatus

source: From File
fi: Tiedostosta

source: From Text
fi: Tekstistä

source: General
fi: Yleiset

source: Get Started with a Template
fi: Aloita mallilla

source: Got it!
fi: Selvä!

source: Haptic Feedback
fi: Kosketuspalaute

source: Haptic feedback provides tactile responses for app interactions
fi: Kosketuspalaute antaa tuntomukaisia vasteita sovelluksen toiminnoille

source: Help & Tips
fi: Ohje ja vinkit

source: Hide crossed out items
fi: Piilota yliviivatut tuotteet

source: iCloud Restricted
fi: iCloud rajoitettu

source: iCloud Sync
fi: iCloud-synkronointi

source: ID:
fi: Tunnus:

source: Image
fi: Kuva

# Image %lld of %lld
source: Image %1$lld of %2$lld
fi: Kuva %lld/%lld

source: Image data unavailable
fi: Kuvatietoja ei saatavilla

source: Images
fi: Kuvat

source: Images will be embedded as base64 in JSON
fi: Kuvat upotetaan base64-muodossa JSONiin

source: Immediately
fi: Heti

source: Import Data
fi: Tuo tiedot

source: Import from Text
fi: Tuo tekstistä

source: Import Preview
fi: Tuonnin esikatselu

source: Import Source
fi: Tuontilähde

source: Import Strategy
fi: Tuontistrategia

source: Import Summary
fi: Tuonnin yhteenveto

source: Importing...
fi: Tuodaan...

source: Include Crossed Out Items
fi: Sisällytä yliviivatut tuotteet

source: Include Dates
fi: Sisällytä päivämäärät

source: Include Descriptions
fi: Sisällytä kuvaukset

source: Include Images
fi: Sisällytä kuvat

source: Include in Export
fi: Sisällytä vientiin

source: Include Quantities
fi: Sisällytä määrät

source: Invalid
fi: Virheellinen

source: Item
fi: Tuote

source: Item Descriptions
fi: Tuotteiden kuvaukset

source: Item Details
fi: Tuotteen tiedot

source: Item Images
fi: Tuotteiden kuvat

source: Item Name
fi: Tuotteen nimi

source: Item Quantities
fi: Tuotteiden määrät

source: Item Title
fi: Tuotteen nimi

source: Keep Editing
fi: Jatka muokkausta

source: Language
fi: Kieli

source: Language Changed
fi: Kieli vaihdettu

source: Last Modified:
fi: Viimeksi muokattu:

source: Last sync: %@
fi: Viimeisin synkronointi: %@

source: Left
fi: Vasen

source: list
fi: lista

source: List Details
fi: Listan tiedot

source: List Name
fi: Listan nimi

source: ListAll Features
fi: ListAll-ominaisuudet

source: Lists
fi: Listat

source: Lists: %lld/%lld
fi: Listat: %lld/%lld

source: Loading items...
fi: Ladataan tuotteita...

source: Loading lists...
fi: Ladataan listoja...

source: Locked
fi: Lukittu

source: Manual
fi: Manuaalinen

source: Merge
fi: Yhdistä

source: Modified Date
fi: Muokkauspäivä

source: Move
fi: Siirrä

# Move %lld item(s) to "%@"? Items will be removed from this list.
source: Move %1$lld item(s) to "%2$@"? Items will be removed from this list.
fi: Siirrä %lld tuotetta listaan "%@"? Tuotteet poistetaan tästä listasta.

source: Move Items
fi: Siirrä tuotteita

source: New Item
fi: Uusi tuote

source: New List
fi: Uusi lista

source: No Active Items
fi: Ei aktiivisia tuotteita

source: No Archived Lists
fi: Ei arkistoituja listoja

source: No Completed Items
fi: Ei suoritettuja tuotteita

source: No completed items yet
fi: Ei vielä suoritettuja tuotteita

source: No iCloud Account
fi: Ei iCloud-tiliä

source: No images to display
fi: Ei näytettäviä kuvia

source: No Items
fi: Ei tuotteita

source: No items have descriptions
fi: Tuotteilla ei ole kuvauksia

source: No items have images
fi: Tuotteilla ei ole kuvia

source: No Items with Description
fi: Ei tuotteita kuvauksen kanssa

source: No Items with Images
fi: Ei tuotteita kuvien kanssa

source: No Items Yet
fi: Ei vielä tuotteita

source: No List Selected
fi: Ei valittua listaa

source: No Lists
fi: Ei listoja

source: No lists available
fi: Ei listoja saatavilla

source: No Other Lists
fi: Ei muita listoja

source: Notes
fi: Muistiinpanot

source: Offline
fi: Ei yhteyttä

source: optional
fi: valinnainen

source: or
fi: tai

source: Order
fi: Järjestys

source: Organization
fi: Järjestely

source: Organize everything in one place
fi: Järjestä kaikki yhdessä paikassa

source: Paste
fi: Liitä

source: Paste Data
fi: Liitä tiedot

source: Paste your data here... Examples: • JSON export format • Plain text lists • One item per line • Markdown checkboxes
fi: Liitä tietosi tähän... Esimerkkejä: • JSON-vientimuoto • Pelkkä teksti -listat • Yksi tuote riviä kohti • Markdown-valintaruudut

source: Pending
fi: Odottaa

source: Permanently Delete List
fi: Poista lista pysyvästi

source: Plain Text
fi: Pelkkä teksti

source: Pull down to refresh
fi: Vedä alas päivittääksesi

source: Qty: %lld
fi: Määrä: %lld

source: Quantity
fi: Määrä

source: Replace All
fi: Korvaa kaikki

source: Require %@
fi: Vaadi %@

source: Require Authentication
fi: Vaadi todentaminen

source: Require authentication every time
fi: Vaadi todentaminen joka kerta

source: Reset
fi: Nollaa

source: Reset All Tips
fi: Nollaa kaikki vinkit

source: Reset to Default
fi: Palauta oletukseen

source: Resolution Options
fi: Ratkaisuvaihtoehdot

source: Restore
fi: Palauta

source: Restore List
fi: Palauta lista

source: Retry
fi: Yritä uudelleen

source: Right
fi: Oikea

source: Save
fi: Tallenna

source: Score: %lld
fi: Pisteet: %lld

source: Search across all items in this list
fi: Etsi kaikkia tämän listan tuotteita

source: Search items
fi: Etsi tuotteita

source: Security
fi: Turvallisuus

# Select a destination list to %@ %lld item(s)
source: Select a destination list to %1$@ %2$lld item(s)
fi: Valitse kohdelista %2$lld tuotteen %1$@

source: Select a list from the sidebar or create a new one.
fi: Valitse lista sivupalkista tai luo uusi.

source: Select All
fi: Valitse kaikki

source: Select File to Import
fi: Valitse tuotava tiedosto

source: Select Format
fi: Valitse muoto

source: Select from your photo library
fi: Valitse valokuvakirjastostasi

source: Settings
fi: Asetukset

source: Share
fi: Jaa

source: Share all data
fi: Jaa kaikki tiedot

source: Share Error
fi: Jakamisvirhe

source: Share list
fi: Jaa lista

source: Share Options
fi: Jakamisvalinnat

source: Show Active Lists
fi: Näytä aktiiviset listat

source: Show All
fi: Näytä kaikki

source: Show All Tips Again
fi: Näytä kaikki vinkit uudelleen

source: Show Archived Lists
fi: Näytä arkistoidut listat

source: Show crossed out items
fi: Näytä yliviivatut tuotteet

source: Show Top 3
fi: Näytä 3 parasta

source: Simple readable text format
fi: Yksinkertainen luettava tekstimuoto

source: Simple text format, easy to read
fi: Yksinkertainen tekstimuoto, helppo lukea

source: Smart Suggestions
fi: Älykkäät ehdotukset

source: Sort & Filter
fi: Lajittele ja suodata

source: Sort and filter items to organize your view
fi: Lajittele ja suodata tuotteita järjestääksesi näkymäsi

source: Sort and filter options
fi: Lajittelu- ja suodatusvalinnat

source: Sort By
fi: Lajittele

source: Sorting
fi: Lajittelu

source: Spreadsheet-compatible format
fi: Taulukkolaskentayhteensopiva muoto

source: Start adding items to your list
fi: Aloita lisäämällä tuotteita listaasi

source: Structured data format
fi: Rakenteellinen datamuoto

source: Suggestions (%lld)
fi: Ehdotukset (%lld)

source: Summary
fi: Yhteenveto

source: Supports JSON or plain text (one item per line)
fi: Tukee JSONia tai pelkkää tekstiä (yksi tuote riviä kohti)

source: Swipe Actions
fi: Pyyhkäisytoiminnot

source: Swipe left on items for quick actions like delete and duplicate
fi: Pyyhkäise vasemmalle pikatoimintoihin kuten poista ja monista

source: Sync
fi: Synkronointi

source: Sync Conflict
fi: Synkronointiristiriita

source: Sync Conflict Detected
fi: Synkronointiristiriita havaittu

source: Sync Error
fi: Synkronointivirhe

source: Sync with iCloud and Apple Watch
fi: Synkronoi iCloudin ja Apple Watchin kanssa

source: Synced
fi: Synkronoitu

source: Syncing with Watch...
fi: Synkronoidaan kellon kanssa...

source: syncing...
fi: synkronoidaan...

source: Take Photo
fi: Ota kuva

source: Tap + to create your first list
fi: Napauta + luodaksesi ensimmäisen listan

source: Tap image to view full size
fi: Napauta kuvaa nähdäksesi koko koon

source: Tap to view items in this list
fi: Napauta nähdäksesi tämän listan tuotteet

source: Temporarily Unavailable
fi: Tilapäisesti poissa käytöstä

source: Text
fi: Teksti

source: The language has been changed. Some changes will take effect immediately, but you may need to restart the app for all text to update.
fi: Kieli on vaihdettu. Jotkin muutokset tulevat voimaan välittömästi, mutta saatat joutua käynnistämään sovelluksen uudelleen, jotta kaikki teksti päivittyy.

source: This action cannot be undone.
fi: Tätä toimintoa ei voi peruuttaa.

source: This item has been modified on multiple devices. Choose how to resolve the conflict.
fi: Tätä tuotetta on muokattu usealla laitteella. Valitse miten ratkaista ristiriita.

source: This list was empty when archived
fi: Tämä lista oli tyhjä arkistoitaessa

source: This will create a copy of "%@" with all its items.
fi: Tämä luo kopion listasta "%@" kaikilla sen tuotteilla.

source: This will show all feature tips again as if you're using the app for the first time. Tips will appear when you use different features.
fi: Tämä näyttää kaikki ominaisuusvinkit uudelleen ikään kuin käyttäisit sovellusta ensimmäistä kertaa. Vinkit ilmestyvät kun käytät eri ominaisuuksia.

source: Timeout Duration
fi: Aikakatkaisu

source: Tips marked with ✓ have been viewed. Tips will appear automatically when you use features, or you can reset them to see all tips again from Settings.
fi: ✓-merkityt vinkit on katsottu. Vinkit ilmestyvät automaattisesti toimintoja käyttäessäsi, tai voit nollata ne nähdäksesi kaikki vinkit uudestaan Asetuksista.

source: Title
fi: Nimi

source: Total Items:
fi: Tuotteita yhteensä:

source: Try Again
fi: Yritä uudelleen

source: Unable to edit item - list not found
fi: Tuotetta ei voi muokata - listaa ei löydy

source: Unable to load image
fi: Kuvaa ei voi ladata

source: Undo
fi: Kumoa

source: Unknown Status
fi: Tuntematon tila

source: Unlock with %@
fi: Avaa %@

source: Unlock with Passcode
fi: Avaa PIN-koodilla

source: Update existing items and add new ones
fi: Päivitä olemassa olevat ja lisää uudet

source: Use arrows to reorder images
fi: Käytä nuolia kuvien järjestämiseen

source: Use camera to take a new photo
fi: Käytä kameraa uuden kuvan ottamiseen

source: Use Default Options
fi: Käytä oletusasetuksia

source: Use Minimal Options
fi: Käytä minimiasetuksia

source: Used: %@
fi: Käytetty: %@

source: Version
fi: Versio

source: View All Feature Tips
fi: Näytä kaikki ominaisuusvinkit

source: Welcome to ListAll
fi: Tervetuloa ListAlliin

source: What's next?
fi: Mitä seuraavaksi?

source: When enabled, you'll need to authenticate with %@ or passcode to unlock the app.
fi: Kun käytössä, sinun täytyy todentaa %@ tai PIN-koodilla avataksesi sovelluksen.

source: With Description
fi: Kuvauksen kanssa

source: With Images
fi: Kuvien kanssa

source: You have unsaved changes. Are you sure you want to discard them?
fi: Sinulla on tallentamattomia muutoksia. Haluatko varmasti hylätä ne?

source: You've completed all items in this list.
fi: Olet suorittanut kaikki tuotteet tästä listasta.
